# Gold Rate Puzzle

Source: https://msbiskills.com/2015/03/22/t-sql-query-gold-rate-puzzle/

In the puzzle we have gold rate changing all the time. We have to find the start date, end Date and the gold rate at that duration. If the gold rate is changed then only we have create a new row. Please check the sample input and the expected output.

In [1]:
%run Question.ipynb

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
9 rows affected.
9 rows affected.

In [2]:
%%sql

SELECT * FROM rates;

 * postgresql://fknight:***@localhost/postgres
9 rows affected.

[(datetime.date(2014, 9, 18), 27000),
 (datetime.date(2014, 9, 19), 27000),
 (datetime.date(2014, 9, 20), 31000),
 (datetime.date(2014, 9, 21), 31000),
 (datetime.date(2014, 9, 22), 31000),
 (datetime.date(2014, 9, 23), 32000),
 (datetime.date(2014, 9, 24), 31000),
 (datetime.date(2014, 9, 25), 32000),
 (datetime.date(2014, 9, 26), 27000)]

# Part A

Place the dates into groups, where the start of each date group is marked with "1" and consecutive dates are marked with "0".

## The expected output

|dt|rate|start_of_seq|
|--- |--- |--- |
|2014-09-18|27000|1|
|2014-09-19|27000|0|
|2014-09-20|31000|1|
|2014-09-21|31000|0|
|2014-09-22|31000|0|
|2014-09-23|32000|1|
|2014-09-24|31000|1|
|2014-09-25|32000|1|
|2014-09-26|27000|1|

# Type your SQL below

In [ ]:
# %%sql
#
# Type your query here